Дошкольное_учреждение83/src/Documents/удуСписаниеТМЦ/удуСписаниеТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуСписаниеТМЦ</name>
  <registerRecords>AccumulationRegister.удуТМЦ_НаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.удуСклады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладыВТабличнойЧасти</name>
    <comment>Указывать склады в таб. части</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КВД</name>
    <type>
      <types>EnumRef.удуКВД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.удуНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.удуИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.удуСклады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчетныеЕдиницы</name>
    <attributes>
      <name>УчетнаяЕдиница</name>
      <type>
        <types>CatalogRef.удуУчетныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>CatalogRef.удуИнвентарныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.удуСклады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/AccumulationRegisters/удуТМЦ_НаСкладах/удуТМЦ_НаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуТМЦ_НаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.удуСклады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.удуНоменклатура</types>
      <types>CatalogRef.удуУчетныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.удуИнвентарныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КВД</name>
    <type>
      <types>EnumRef.удуКВД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/Documents/удуСписаниеТМЦ/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СкладыВТабличнойЧасти Тогда
		ПроверяемыеРеквизиты.Добавить("ТМЦ.Склад");
		ПроверяемыеРеквизиты.Добавить("УчетныеЕдиницы.Склад");
	Иначе
		ПроверяемыеРеквизиты.Добавить("Склад");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.удуТМЦ_НаСкладах.Записывать = Истина;
	Движения.удуТМЦ_НаСкладах.Записать();
	
    Отказ = удуУчетТМЦСервер.ПроверитьВозможностьСписанияТМЦ(ЭтотОбъект);
	
	Для Каждого ТекСтрокаТМЦ Из ТМЦ Цикл
		// регистр удуТМЦ_НаСкладах Расход
		Движение = Движения.удуТМЦ_НаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Учреждение = Организация;
		
		Если СкладыВТабличнойЧасти Тогда
			Движение.Склад = ТекСтрокаТМЦ.Склад;
		Иначе
			Движение.Склад = Склад;
		КонецЕсли;
		
		Движение.ИнвентарныйНомер = ТекСтрокаТМЦ.ИнвентарныйНомер;
		Движение.Номенклатура     = ТекСтрокаТМЦ.Номенклатура;
		Движение.КВД              = КВД;
		Движение.Количество       = ТекСтрокаТМЦ.Количество;
	КонецЦикла;
	
	Для Каждого ТекСтрокаУЕд Из УчетныеЕдиницы Цикл
		// регистр удуТМЦ_НаСкладах Расход
		// таб часть "УчетныеЕдиницы"
		Движение = Движения.удуТМЦ_НаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период      = Дата;
		Движение.Учреждение  = Организация;
		
		Если СкладыВТабличнойЧасти Тогда
			Движение.Склад = ТекСтрокаУЕд.Склад;
		Иначе
			Движение.Склад = Склад;
		КонецЕсли;
		
		Движение.ИнвентарныйНомер = ТекСтрокаУЕд.ИнвентарныйНомер;
		Движение.Номенклатура     = ТекСтрокаУЕд.УчетнаяЕдиница;
		Движение.КВД              = КВД;
		Движение.Количество       = ТекСтрокаУЕд.Количество;
	КонецЦикла;

	
	Движения.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
